#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ 1
Ġ 0
2 5
Ġ 7
Ġ 2
Ġ 3
Ġ 6
Ġ 8
7 5
3 3
Ġ G
Ġ E
Ġ B
Ġ C
Ġ F
6 7
Ġ 5
Ġ 4
Ġ A
Ġ D
Ġ 9
Ġ8 0
Ġ6 4
Ġ7 0
Ġ7 2
Ġ7 4
Ġ7 3
Ġ7 1
Ġ7 6
Ġ7 5
Ġ7 7
Ġ7 8
Ġ7 9
Ġ6 9
Ġ6 8
Ġ6 7
Ġ6 6
Ġ8 1
Ġ6 5
Ġ1 0
Ġ8 2
Ġ8 3
Ġ6 2
Ġ6 3
Ġ8 4
Ġ6 0
Ġ6 1
Ġ8 5
Ġ5 9
Ġ5 8
Ġ5 7
Ġ10 0
Ġ8 6
Ġ5 6
Ġ8 7
Ġ5 5
Ġ5 4
Ġ8 8
Ġ4 9
Ġ5 3
Ġ5 2
Ġ8 9
Ġ5 1
Ġ5 0
Ġ9 0
Ġ4 8
Ġ9 1
Ġ4 7
Ġ4 6
Ġ9 2
Ġ4 5
Ġ9 3
Ġ4 4
Ġ4 3
Ġ9 5
Ġ4 2
Ġ9 4
Ġ4 1
Ġ4 0
Ġ9 6
1 7
0 8
Ġ3 9
4 2
Ġ3 8
Ġ9 7
Ġ3 7
Ġ3 6
Ġ9 8
Ġ3 5
Ġ3 4
Ġ9 9
5 8
Ġ3 3
9 2
8 3
Ġ3 2
Ġ3 1
Ġ10 1
Ġ3 0
Ġ1 1
Ġ10 2
Ġ2 9
Ġ10 3
Ġ2 8
Ġ10 4
Ġ2 7
Ġ2 6
Ġ1 2
Ġ10 5
Ġ 25
Ġ10 6
Ġ12 7
Ġ2 4
Ġ2 3
Ġ11 0
Ġ10 8
Ġ10 7
Ġ10 9
Ġ2 1
Ġ2 2
Ġ2 0
Ġ11 1
Ġ1 9
Ġ11 2
Ġ1 8
Ġ11 3
Ġ1 7
Ġ11 4
Ġ11 5
Ġ1 6
Ġ1 5
Ġ1 4
Ġ1 17
Ġ1 3
Ġ12 6
Ġ11 6
Ġ11 8
Ġ12 0
Ġ12 4
Ġ1 25
Ġ12 1
Ġ12 3
Ġ11 9
Ġ12 2
Ġ13 1
Ġ13 4
Ġ13 6
Ġ13 9
