{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "Ġ1": 257,
      "Ġ0": 258,
      "25": 259,
      "Ġ7": 260,
      "Ġ2": 261,
      "Ġ3": 262,
      "Ġ6": 263,
      "Ġ8": 264,
      "75": 265,
      "33": 266,
      "ĠG": 267,
      "ĠE": 268,
      "ĠB": 269,
      "ĠC": 270,
      "ĠF": 271,
      "67": 272,
      "Ġ5": 273,
      "Ġ4": 274,
      "ĠA": 275,
      "ĠD": 276,
      "Ġ9": 277,
      "Ġ80": 278,
      "Ġ64": 279,
      "Ġ70": 280,
      "Ġ72": 281,
      "Ġ74": 282,
      "Ġ73": 283,
      "Ġ71": 284,
      "Ġ76": 285,
      "Ġ75": 286,
      "Ġ77": 287,
      "Ġ78": 288,
      "Ġ79": 289,
      "Ġ69": 290,
      "Ġ68": 291,
      "Ġ67": 292,
      "Ġ66": 293,
      "Ġ81": 294,
      "Ġ65": 295,
      "Ġ10": 296,
      "Ġ82": 297,
      "Ġ83": 298,
      "Ġ62": 299,
      "Ġ63": 300,
      "Ġ84": 301,
      "Ġ60": 302,
      "Ġ61": 303,
      "Ġ85": 304,
      "Ġ59": 305,
      "Ġ58": 306,
      "Ġ57": 307,
      "Ġ100": 308,
      "Ġ86": 309,
      "Ġ56": 310,
      "Ġ87": 311,
      "Ġ55": 312,
      "Ġ54": 313,
      "Ġ88": 314,
      "Ġ49": 315,
      "Ġ53": 316,
      "Ġ52": 317,
      "Ġ89": 318,
      "Ġ51": 319,
      "Ġ50": 320,
      "Ġ90": 321,
      "Ġ48": 322,
      "Ġ91": 323,
      "Ġ47": 324,
      "Ġ46": 325,
      "Ġ92": 326,
      "Ġ45": 327,
      "Ġ93": 328,
      "Ġ44": 329,
      "Ġ43": 330,
      "Ġ95": 331,
      "Ġ42": 332,
      "Ġ94": 333,
      "Ġ41": 334,
      "Ġ40": 335,
      "Ġ96": 336,
      "17": 337,
      "08": 338,
      "Ġ39": 339,
      "42": 340,
      "Ġ38": 341,
      "Ġ97": 342,
      "Ġ37": 343,
      "Ġ36": 344,
      "Ġ98": 345,
      "Ġ35": 346,
      "Ġ34": 347,
      "Ġ99": 348,
      "58": 349,
      "Ġ33": 350,
      "92": 351,
      "83": 352,
      "Ġ32": 353,
      "Ġ31": 354,
      "Ġ101": 355,
      "Ġ30": 356,
      "Ġ11": 357,
      "Ġ102": 358,
      "Ġ29": 359,
      "Ġ103": 360,
      "Ġ28": 361,
      "Ġ104": 362,
      "Ġ27": 363,
      "Ġ26": 364,
      "Ġ12": 365,
      "Ġ105": 366,
      "Ġ25": 367,
      "Ġ106": 368,
      "Ġ127": 369,
      "Ġ24": 370,
      "Ġ23": 371,
      "Ġ110": 372,
      "Ġ108": 373,
      "Ġ107": 374,
      "Ġ109": 375,
      "Ġ21": 376,
      "Ġ22": 377,
      "Ġ20": 378,
      "Ġ111": 379,
      "Ġ19": 380,
      "Ġ112": 381,
      "Ġ18": 382,
      "Ġ113": 383,
      "Ġ17": 384,
      "Ġ114": 385,
      "Ġ115": 386,
      "Ġ16": 387,
      "Ġ15": 388,
      "Ġ14": 389,
      "Ġ117": 390,
      "Ġ13": 391,
      "Ġ126": 392,
      "Ġ116": 393,
      "Ġ118": 394,
      "Ġ120": 395,
      "Ġ124": 396,
      "Ġ125": 397,
      "Ġ121": 398,
      "Ġ123": 399,
      "Ġ119": 400,
      "Ġ122": 401,
      "Ġ131": 402,
      "Ġ134": 403,
      "Ġ136": 404,
      "Ġ139": 405
    },
    "merges": [
      "Ġ 1",
      "Ġ 0",
      "2 5",
      "Ġ 7",
      "Ġ 2",
      "Ġ 3",
      "Ġ 6",
      "Ġ 8",
      "7 5",
      "3 3",
      "Ġ G",
      "Ġ E",
      "Ġ B",
      "Ġ C",
      "Ġ F",
      "6 7",
      "Ġ 5",
      "Ġ 4",
      "Ġ A",
      "Ġ D",
      "Ġ 9",
      "Ġ8 0",
      "Ġ6 4",
      "Ġ7 0",
      "Ġ7 2",
      "Ġ7 4",
      "Ġ7 3",
      "Ġ7 1",
      "Ġ7 6",
      "Ġ7 5",
      "Ġ7 7",
      "Ġ7 8",
      "Ġ7 9",
      "Ġ6 9",
      "Ġ6 8",
      "Ġ6 7",
      "Ġ6 6",
      "Ġ8 1",
      "Ġ6 5",
      "Ġ1 0",
      "Ġ8 2",
      "Ġ8 3",
      "Ġ6 2",
      "Ġ6 3",
      "Ġ8 4",
      "Ġ6 0",
      "Ġ6 1",
      "Ġ8 5",
      "Ġ5 9",
      "Ġ5 8",
      "Ġ5 7",
      "Ġ10 0",
      "Ġ8 6",
      "Ġ5 6",
      "Ġ8 7",
      "Ġ5 5",
      "Ġ5 4",
      "Ġ8 8",
      "Ġ4 9",
      "Ġ5 3",
      "Ġ5 2",
      "Ġ8 9",
      "Ġ5 1",
      "Ġ5 0",
      "Ġ9 0",
      "Ġ4 8",
      "Ġ9 1",
      "Ġ4 7",
      "Ġ4 6",
      "Ġ9 2",
      "Ġ4 5",
      "Ġ9 3",
      "Ġ4 4",
      "Ġ4 3",
      "Ġ9 5",
      "Ġ4 2",
      "Ġ9 4",
      "Ġ4 1",
      "Ġ4 0",
      "Ġ9 6",
      "1 7",
      "0 8",
      "Ġ3 9",
      "4 2",
      "Ġ3 8",
      "Ġ9 7",
      "Ġ3 7",
      "Ġ3 6",
      "Ġ9 8",
      "Ġ3 5",
      "Ġ3 4",
      "Ġ9 9",
      "5 8",
      "Ġ3 3",
      "9 2",
      "8 3",
      "Ġ3 2",
      "Ġ3 1",
      "Ġ10 1",
      "Ġ3 0",
      "Ġ1 1",
      "Ġ10 2",
      "Ġ2 9",
      "Ġ10 3",
      "Ġ2 8",
      "Ġ10 4",
      "Ġ2 7",
      "Ġ2 6",
      "Ġ1 2",
      "Ġ10 5",
      "Ġ 25",
      "Ġ10 6",
      "Ġ12 7",
      "Ġ2 4",
      "Ġ2 3",
      "Ġ11 0",
      "Ġ10 8",
      "Ġ10 7",
      "Ġ10 9",
      "Ġ2 1",
      "Ġ2 2",
      "Ġ2 0",
      "Ġ11 1",
      "Ġ1 9",
      "Ġ11 2",
      "Ġ1 8",
      "Ġ11 3",
      "Ġ1 7",
      "Ġ11 4",
      "Ġ11 5",
      "Ġ1 6",
      "Ġ1 5",
      "Ġ1 4",
      "Ġ1 17",
      "Ġ1 3",
      "Ġ12 6",
      "Ġ11 6",
      "Ġ11 8",
      "Ġ12 0",
      "Ġ12 4",
      "Ġ1 25",
      "Ġ12 1",
      "Ġ12 3",
      "Ġ11 9",
      "Ġ12 2",
      "Ġ13 1",
      "Ġ13 4",
      "Ġ13 6",
      "Ġ13 9"
    ]
  }
}